emacs/.emacs-config.el
;; Information about me
(setq user-full-name "Mikhail Kirillov"
      user-mail-address "w96k@posteo.net")

;;; Set font
  ;;(set-frame-font "terminus 12" nil t)
  (add-to-list 'default-frame-alist '(font . "Fira Code-10.5"))
  (set-frame-font "Fira Code-10.5" nil t)
  (setq-default line-spacing 0)

(use-package fira-code-mode
  :ensure
  :config (global-fira-code-mode))

(global-prettify-symbols-mode)

;;; Load a theme
;;; https://emacsthemes.com/themes/sanityinc-tomorrow-themes.html
(use-package color-theme-sanityinc-tomorrow
  :ensure
  :config (load-theme 'sanityinc-tomorrow-eighties t))

;;; Отображение номера строки ненужно из-за наличия avy-jump
;; (use-package display-line-numbers
;;   :init
;;   (setq display-line-numbers-type 'relative)
;;   (global-display-line-numbers-mode))

(custom-set-faces
 '(mode-line ((t (:background "#333" :foreground "#cccccc" :box (:line-width 1 :color "#2d2d2d" :style released-button) :weight bold :height 1.0 :family "Fira Code")))))

;;; Display current line
(when (display-graphic-p)
(global-hl-line-mode))

(use-package emojify
  :config
  (global-emojify-mode))

;;  Live-checking text
  (use-package flymake
  :config (flymake-mode))

;;(global-flycheck-mode)

;;; Undo system
 (use-package undo-tree
   :diminish
   :config (global-undo-tree-mode))

;;; Autoformatting code
(use-package aggressive-indent
  :ensure t
  :config (global-aggressive-indent-mode))

(use-package ssh-agency
:ensure)
(use-package pass
:ensure)

;;; Show added & removed git lines
(use-package git-gutter+
  :ensure
  :config
  (global-git-gutter+-mode)
  (setq git-gutter+-window-width 1)
  (set-face-background 'git-gutter+-added "#99cc99")
  (set-face-background 'git-gutter+-deleted "#f2777a")
  (set-face-background 'git-gutter+-modified "#ffcc66")
  (set-face-background 'git-gutter+-unchanged "#393939")
  (setq git-gutter+-added-sign " ")
  (setq git-gutter+-modified-sign " ")
  (setq git-gutter+-deleted-sign " ")
  (setq git-gutter+-unchanged-sign " ")

  (progn
    (define-key git-gutter+-mode-map (kbd "C-x n") 'git-gutter+-next-hunk)
    (define-key git-gutter+-mode-map (kbd "C-x p") 'git-gutter+-previous-hunk)
    (define-key git-gutter+-mode-map (kbd "C-x v =") 'git-gutter+-show-hunk)
    (define-key git-gutter+-mode-map (kbd "C-x r") 'git-gutter+-revert-hunks)
    (define-key git-gutter+-mode-map (kbd "C-x t") 'git-gutter+-stage-hunks)
    (define-key git-gutter+-mode-map (kbd "C-x c") 'git-gutter+-commit)
    (define-key git-gutter+-mode-map (kbd "C-x C") 'git-gutter+-stage-and-commit)
    (define-key git-gutter+-mode-map (kbd "C-x C-y") 'git-gutter+-stage-and-commit-whole-buffer)
    (define-key git-gutter+-mode-map (kbd "C-x U") 'git-gutter+-unstage-whole-buffer))
  :diminish (git-gutter+-mode . "gg"))

(use-package browse-kill-ring 
  :ensure
  :config (browse-kill-ring-default-keybindings))

(use-package avy
  :config 
  (define-key global-map (kbd "C-c s") 'avy-goto-char)
  (define-key global-map (kbd "C-c l") 'avy-goto-line))

(use-package swiper
  :ensure t)

(use-package counsel
  :ensure t)

(use-package ivy
    :diminish
    :config
    (setq ivy-use-virtual-buffers t)
    (setq enable-recursive-minibuffers t)
    (global-set-key "\C-s" 'swiper)
    (global-set-key (kbd "C-c C-r") 'ivy-resume)
    (global-set-key (kbd "<f6>") 'ivy-resume)
    (global-set-key (kbd "M-x") 'counsel-M-x)
    (global-set-key (kbd "C-x C-f") 'counsel-find-file)
    (global-set-key (kbd "<f1> f") 'counsel-describe-function)
    (global-set-key (kbd "<f1> v") 'counsel-describe-variable)
    (global-set-key (kbd "<f1> l") 'counsel-find-library)
    (global-set-key (kbd "<f2> i") 'counsel-info-lookup-symbol)
    (global-set-key (kbd "<f2> u") 'counsel-unicode-char)
    (global-set-key (kbd "C-c g") 'counsel-git)
    (global-set-key (kbd "C-c j") 'counsel-git-grep)
    (global-set-key (kbd "C-c k") 'counsel-ag)
    (global-set-key (kbd "C-x l") 'counsel-locate)
    (global-set-key (kbd "C-S-o") 'counsel-rhythmbox)
    (define-key minibuffer-local-map (kbd "C-r")
    'counsel-minibuffer-history)
    (ivy-mode 1))

(use-package pos-tip
  :ensure t)

(use-package company
  :diminish
  :custom
  (company-require-match nil)
  (company-minimum-prefix-length 1)
  (company-idle-delay 0)
  (company-tooltip-align-annotation t)
  :hook ((prog-mode . company-mode))
  :bind (:map company-active-map
	      ("C-n" . company-select-next)
	      ("C-p" . company-select-previous)))

(use-package company-quickhelp
  :after company pos-tip
  :config (company-quickhelp-mode))

;;; Project Management
(use-package projectile
  :diminish
  :bind (("s-p" . projectile-command-map)
	 ("C-c p" . projectile-command-map))
  :config
  (projectile-global-mode))

;;; Jump to defenition
(use-package dumb-jump
  :bind (("M-g o" . dumb-jump-go-other-window)
	 ("M-g j" . dumb-jump-go)
	 ("M-g i" . dumb-jump-go-prompt)
	 ("M-g x" . dumb-jump-go-prefer-external)
	 ("M-g z" . dumb-jump-go-prefer-external-other-window)))

(use-package hydra)

;;; 80 column width limit highlighter
(use-package column-enforce-mode
  :ensure t
  :diminish
  :config
  (80-column-rule))

;;; Show pair for a parenthesis
(show-paren-mode)

;;; Input of pair delimiters
(electric-pair-mode)

;;; Change Move to end & beginning of the line behavior
(use-package mwim
  :ensure
  :config
  (global-set-key (kbd "C-a") 'mwim-beginning)
  (global-set-key (kbd "C-e") 'mwim-end))

;;; Delete trailing whitespace on save
(use-package whitespace-cleanup-mode
  :diminish
  :config (global-whitespace-cleanup-mode))

;;; Editor Config support
(use-package editorconfig
  :diminish
  :config
  (editorconfig-mode 1))

;;; Edit with root user
(use-package sudo-edit)

;;; Color parens
(use-package rainbow-delimiters
  :hook ((prog-mode . rainbow-delimiters-mode)))

;;; Parens editing
(use-package paredit)

(use-package scheme-complete
  :after company)

(use-package geiser)

;; (use-package elpy
;;   :ensure t
;;   :init
;;   (elpy-enable)
;;   :config
;;   (setq elpy-rpc-python-command "python3"
;; 	python-shell-interpreter "python3"
;; 	;;python-shell-interpreter "ipython" elpy-modules
;; 	elpy-rpc-virtualenv-path 'current
;; 	pyvenv-mode-line-indicator t )
;;   :bind
;;   ("C-c p" . elpy-autopep8-fix-code)
;;   ("C-c b" . elpy-black-fix-code))

;; (use-package anaconda-mode
;;   :ensure
;;   :hook (python-mode . anaconda-mode)
;;   (python-mode . anaconda-eldoc-mode))

(use-package jinja2-mode
  :ensure t)

;; (use-package company-anaconda
;;   :ensure
;;   :after company
;;   :config
;;   (add-to-list 'company-backends '(company-anaconda :with company-capf)))

;;; Access python documentation
(use-package pydoc
  :commands pydoc
  :config (setq pydoc-command "python3 -m pydoc"))

;;; Javascript
