emacs/.emacs-config.org
*** Основной мод
#+BEGIN_SRC emacs-lisp
;;; Javascript
(use-package js2-mode
  :ensure t
  :config
  (add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))
  (setq-default js2-basic-offset 2)
  (add-hook 'js2-mode-hook
	    (lambda ()
	      (define-key js-mode-map (kbd "C-x C-e") 'nodejs-repl-send-last-expression)
	      (define-key js-mode-map (kbd "C-c C-j") 'nodejs-repl-send-line)
	      (define-key js-mode-map (kbd "C-c C-r") 'nodejs-repl-send-region)
	      (define-key js-mode-map (kbd "C-c C-l") 'nodejs-repl-load-file)
	      (define-key js-mode-map (kbd "C-c C-z") 'nodejs-repl-switch-to-repl))))
#+END_SRC
*** Node.js REPL
#+BEGIN_SRC emacs-lisp
;;; Node.js Repl
(use-package nodejs-repl)
#+END_SRC
*** Typescript
#+BEGIN_SRC emacs-lisp
;;; Typescript support
(use-package typescript-mode)
#+END_SRC
*** Vue.js
#+BEGIN_SRC emacs-lisp
;;; Vue
(use-package vue-mode
  :ensure
  :config (setq mmm-submode-decoration-level 0))
#+END_SRC
** Haskell
*** Основной мод
#+BEGIN_SRC emacs-lisp
;;; Haskell
(use-package haskell-mode)
#+END_SRC
*** Окружение разработки
#+BEGIN_SRC emacs-lisp
;;; Haskell support
(use-package intero
  :ensure
  :after haskell-mode
  :config (add-hook 'haskell-mode-hook 'intero-mode))
#+END_SRC
** Лиспы в целом
*** Lispy
#+BEGIN_SRC elisp
(use-package lispy)
#+END_SRC
*** Parinfer
#+BEGIN_SRC elisp
(use-package parinfer
  :after lispy
  :bind
  (("C-," . parinfer-toggle-mode))
  :init
  (progn
    (setq parinfer-extensions
	  '(defaults       ; should be included.
	    pretty-parens  ; different paren styles for different modes.
	    lispy          ; If you use Lispy. With this extension, you should install Lispy and do not enable lispy-mode directly.
	    paredit        ; Introduce some paredit commands.
	    smart-tab      ; C-b & C-f jump positions and smart shift with tab & S-tab.
	    smart-yank))   ; Yank behavior depend on mode.
    (add-hook 'clojure-mode-hook #'parinfer-mode)
    (add-hook 'emacs-lisp-mode-hook #'parinfer-mode)
    (add-hook 'common-lisp-mode-hook #'parinfer-mode)
    (add-hook 'scheme-mode-hook #'parinfer-mode)
    (add-hook 'lisp-mode-hook #'parinfer-mode)))
#+END_SRC
** Clojure
*** Mode
#+BEGIN_SRC elisp
(use-package clojure-mode)
#+END_SRC
*** REPL
#+BEGIN_SRC emacs-lisp
;;; Clojure REPL
(use-package cider)
#+END_SRC
*** Рефакторинг
#+BEGIN_SRC elisp
(use-package clj-refactor
  :ensure t
  :hook (clojure-mode . clj-refactor-mode)
  :config
  ((cljr-add-keybindings-with-prefix "C-c C-m")))
#+END_SRC
** Common Lisp
*** REPL
#+BEGIN_SRC emacs-lisp
(use-package slime
  :config

  (setq slime-contribs '(slime-fancy slime-repl slime-banner)))
#+END_SRC
** Fennel
#+BEGIN_SRC emacs-lisp
(use-package fennel-mode
  :ensure
  :config
(define-key fennel-mode-map (kbd "C-c C-k")
     (defun pnh-fennel-hotswap ()
       (interactive)
       (comint-send-string
	(inferior-lisp-proc)
	(format "(lume.hotswap \"%s\")\n"
		(substring (file-name-nondirectory (buffer-file-name)) 0 -4))))))
#+END_SRC
* Языки декларирования
** SQL
#+BEGIN_SRC emacs-lisp

(use-package emacsql)
#+END_SRC
** Веб шаблоны
*** Web-mode
#+BEGIN_SRC emacs-lisp
;;; Templates
(use-package web-mode
  :config
  (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
  (setq web-mode-markup-indent-offset 2)
  (setq web-mode-enable-auto-pairing t)
  (setq web-mode-enable-current-element-highlight t)
  (setq web-mode-enable-current-column-highlight t))
#+END_SRC
** Org-mode
#+BEGIN_SRC emacs-lisp
;;; org
(use-package org
  :config
  (setq org-default-notes-file (concat org-directory "~/Documents/life.org"))
  (global-set-key (kbd "C-c l") 'org-store-link)
  (global-set-key (kbd "C-c a") 'org-agenda)
  (global-set-key (kbd "C-c c") 'org-capture)

(setq org-capture-templates
      (quote (("t" "todo" entry (file "~/git/org/refile.org")
	       "* TODO %?\n%U\n%a\n" :clock-in t :clock-resume t)
	      ("r" "respond" entry (file "~/git/org/refile.org")
	       "* NEXT Respond to %:from on %:subject\nSCHEDULED: %t\n%U\n%a\n" :clock-in t :clock-resume t :immediate-finish t)
	      ("n" "note" entry (file "~/git/org/refile.org")
	       "* %? :NOTE:\n%U\n%a\n" :clock-in t :clock-resume t)
	      ("j" "Journal" entry (file+datetree "~/git/org/diary.org")
	       "* %?\n%U\n" :clock-in t :clock-resume t)
	      ("w" "org-protocol" entry (file "~/git/org/refile.org")
	       "* TODO Review %c\n%U\n" :immediate-finish t)
	      ("m" "Meeting" entry (file "~/git/org/refile.org")
	       "* MEETING with %? :MEETING:\n%U" :clock-in t :clock-resume t)
	      ("p" "Phone call" entry (file "~/git/org/refile.org")
	       "* PHONE %? :PHONE:\n%U" :clock-in t :clock-resume t)
	      ("h" "Habit" entry (file "~/git/org/refile.org")
	       "* NEXT %?\n%U\n%a\nSCHEDULED: %(format-time-string \"%<<%Y-%m-%d %a .+1d/3d>>\")\n:PROPERTIES:\n:STYLE: habit\n:REPEAT_TO_STATE: NEXT\n:END:\n"))))

  (setq org-modules (quote (org-bbdb
			  org-bibtex
			  org-crypt
			  org-gnus
			  org-id
			  org-info
			  org-habit
			  org-inlinetask
			  org-irc
			  org-mhe
			  org-protocol
			  org-w3m)))
  (setq org-todo-keywords
	(quote ((sequence "TODO(t)" "MIGRATE(m)" "|" "DONE(d)")
		(sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)" "PHONE" "MEETING"))))
  (setq org-todo-keyword-faces
	(quote (("TODO" :foreground "red" :weight bold)
		("NEXT" :foreground "blue" :weight bold)
		("DONE" :foreground "forest green" :weight bold)
		("WAITING" :foreground "orange" :weight bold)
		("HOLD" :foreground "magenta" :weight bold)
		("CANCELLED" :foreground "forest green" :weight bold)
		("MEETING" :foreground "forest cyan" :weight bold)
		("PHONE" :foreground "blue" :weight bold)))))
#+END_SRC
*** Пункты списка для org-mode
#+BEGIN_SRC emacs-lisp
;;; Bullets for org-mode
(use-package org-bullets
  :commands org-bullets-mode
  :hook (org-mode . org-bullets-mode))
#+END_SRC
*** Агенда
#+BEGIN_SRC emacs-lisp
;;; Org-mode Setup
(setq org-agenda-files (list
			"~/Documents/life.org"))
#+END_SRC
*** Техника pomodoro
#+BEGIN_SRC emacs-lisp
;;; Pomodoro technique tracking for org-mode
(use-package org-pomodoro)
#+END_SRC
*** Ведение журнала
#+BEGIN_SRC emacs-lisp
;;; Journal
(use-package org-journal
  :ensure)
#+END_SRC
*** Презентации
#+BEGIN_SRC emacs-lisp
;;; Presentation
(use-package epresent
  :ensure t)
#+END_SRC
** Markdown
*** Превью
#+BEGIN_SRC emacs-lisp
;;; Markdown preview
(use-package flymd
  :ensure)
#+END_SRC
** Lilypond
#+BEGIN_SRC emacs-lisp
;;; Lilypond
(progn
  (autoload 'lilypond "lilypond")
  (autoload 'lilypond-mode "lilypond-mode")
  (setq auto-mode-alist
	(cons '("\\.ly$" . LilyPond-mode) auto-mode-alist))
  (add-hook 'LilyPond-mode-hook (lambda () (turn-on-font-lock))))

;;; Flycheck lilypond
(use-package flycheck-lilypond
  :ensure
  :after flycheck)
#+END_SRC
* Коммуникации
*** IRC
#+BEGIN_SRC emacs-lisp
;;; IRC
(use-package erc
  :ensure)
#+END_SRC
*** Telegram
#+BEGIN_SRC emacs-lisp
;;; Telegram client
(use-package telega
  :config
(telega-mode-line-mode 1)
(setq telega-chat-fill-column 60))
#+END_SRC
*** Email
**** Конвертирование org в html
#+BEGIN_SRC emacs-lisp
;;; convert org to html in gnus
(use-package org-mime
  :ensure)
#+END_SRC
*** GNUPG
**** Ввод ключей
#+BEGIN_SRC emacs-lisp
;;; Dialog program for entering password
(use-package pinentry
  :config
  (setq epa-pinentry-mode 'loopback)
  (pinentry-start))
#+END_SRC
* Разное
** Минорные твики дефолтного имакса
*** Улучшение производительности в больших файлах
#+BEGIN_SRC emacs-lisp
  (use-package so-long
    :config (global-so-long-mode 1))
#+END_SRC
*** Скрыть бары и скролл
#+BEGIN_SRC emacs-lisp
;;; Disable emacs gui
(menu-bar-mode -1)
(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)
#+END_SRC
*** Не спрашивать о несуществующих буферах
#+BEGIN_SRC emacs-lisp
(setq-default confirm-nonexistent-file-or-buffer t)
#+END_SRC
*** Спрашивать покороче
    Не спрашивать yes/no, вместо этого спрашивать y/n
#+BEGIN_SRC emacs-lisp
;;; Short messages
(defalias 'yes-or-no-p 'y-or-n-p)
#+END_SRC
*** Сохранение позиции курсора
#+BEGIN_SRC emacs-lisp
(setq
 save-place-forget-unreadable-files t
 save-place-limit 200)

(save-place-mode 1)
#+END_SRC
*** Мигающий курсор
#+BEGIN_SRC emacs-lisp
  (blink-cursor-mode 1)
#+END_SRC
*** Переменная PATH в eshell
#+BEGIN_SRC emacs-lisp
(use-package exec-path-from-shell
  :config
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize)
    (exec-path-from-shell-copy-env "PATH")))
#+END_SRC
*** Не создавать лишних файлов
#+BEGIN_SRC emacs-lisp
  (setq create-lockfiles nil
   make-backup-files nil        ; disable backup files
   auto-save-list-file-name nil ; disable .saves files
   auto-save-default nil)        ; disable auto saving
#+END_SRC
*** Отображение номера колонки
#+BEGIN_SRC emacs-lisp
(column-number-mode)
#+END_SRC
** Which-key
#+BEGIN_SRC emacs-lisp
  (use-package which-key
    :config
    (setq which-key-show-early-on-C-h t)
    (setq which-key-side-window-location 'bottom)
    (setq which-key-idle-delay 0.5)
    (setq which-key-popup-type 'side-window)
    (global-set-key (kbd "C-h C-k") 'which-key-show-major-mode)
    (setq which-key-sort-order 'which-key-prefix-then-key-order)
    (which-key-mode))
#+END_SRC
** Системные пакеты
*** Docker
#+BEGIN_SRC emacs-lisp
;;; Manage docker in emacs
(use-package docker
  :ensure-system-package docker
  :bind ("C-c d" . docker))
#+END_SRC
