emacs/.emacs-config.el
(use-package js2-mode
  :ensure t
  :config
  (add-to-list 'auto-mode-alist '("\\.js\\'" . js2-mode))
  (setq-default js2-basic-offset 2)
  (add-hook 'js2-mode-hook
	    (lambda ()
	      (define-key js-mode-map (kbd "C-x C-e") 'nodejs-repl-send-last-expression)
	      (define-key js-mode-map (kbd "C-c C-j") 'nodejs-repl-send-line)
	      (define-key js-mode-map (kbd "C-c C-r") 'nodejs-repl-send-region)
	      (define-key js-mode-map (kbd "C-c C-l") 'nodejs-repl-load-file)
	      (define-key js-mode-map (kbd "C-c C-z") 'nodejs-repl-switch-to-repl))))

;;; Node.js Repl
(use-package nodejs-repl)

;;; Typescript support
(use-package typescript-mode)

;;; Vue
(use-package vue-mode
  :ensure
  :config (setq mmm-submode-decoration-level 0))

;;; Haskell
(use-package haskell-mode)

;;; Haskell support
(use-package intero
  :ensure
  :after haskell-mode
  :config (add-hook 'haskell-mode-hook 'intero-mode))

;;; Clojure REPL
(use-package cider)

(use-package slime
  :config

  (setq slime-contribs '(slime-fancy slime-repl slime-banner)))

(use-package fennel-mode
  :ensure
  :config
(define-key fennel-mode-map (kbd "C-c C-k")
     (defun pnh-fennel-hotswap ()
       (interactive)
       (comint-send-string
	(inferior-lisp-proc)
	(format "(lume.hotswap \"%s\")\n"
		(substring (file-name-nondirectory (buffer-file-name)) 0 -4))))))

(use-package emacsql)

;;; Templates
(use-package web-mode
  :config
  (add-to-list 'auto-mode-alist '("\\.html?\\'" . web-mode))
  (setq web-mode-markup-indent-offset 2)
  (setq web-mode-enable-auto-pairing t)
  (setq web-mode-enable-current-element-highlight t)
  (setq web-mode-enable-current-column-highlight t))

;;; org
(use-package org
  :config
  (setq org-default-notes-file (concat org-directory "~/Documents/life.org"))
  (global-set-key (kbd "C-c l") 'org-store-link)
  (global-set-key (kbd "C-c a") 'org-agenda)
  (global-set-key (kbd "C-c c") 'org-capture)

(setq org-capture-templates
      (quote (("t" "todo" entry (file "~/git/org/refile.org")
               "* TODO %?\n%U\n%a\n" :clock-in t :clock-resume t)
              ("r" "respond" entry (file "~/git/org/refile.org")
               "* NEXT Respond to %:from on %:subject\nSCHEDULED: %t\n%U\n%a\n" :clock-in t :clock-resume t :immediate-finish t)
              ("n" "note" entry (file "~/git/org/refile.org")
               "* %? :NOTE:\n%U\n%a\n" :clock-in t :clock-resume t)
              ("j" "Journal" entry (file+datetree "~/git/org/diary.org")
               "* %?\n%U\n" :clock-in t :clock-resume t)
              ("w" "org-protocol" entry (file "~/git/org/refile.org")
               "* TODO Review %c\n%U\n" :immediate-finish t)
              ("m" "Meeting" entry (file "~/git/org/refile.org")
               "* MEETING with %? :MEETING:\n%U" :clock-in t :clock-resume t)
              ("p" "Phone call" entry (file "~/git/org/refile.org")
               "* PHONE %? :PHONE:\n%U" :clock-in t :clock-resume t)
              ("h" "Habit" entry (file "~/git/org/refile.org")
               "* NEXT %?\n%U\n%a\nSCHEDULED: %(format-time-string \"%<<%Y-%m-%d %a .+1d/3d>>\")\n:PROPERTIES:\n:STYLE: habit\n:REPEAT_TO_STATE: NEXT\n:END:\n"))))

  (setq org-modules (quote (org-bbdb
                          org-bibtex
                          org-crypt
                          org-gnus
                          org-id
                          org-info
                          org-habit
                          org-inlinetask
                          org-irc
                          org-mhe
                          org-protocol
                          org-w3m)))
  (setq org-todo-keywords
	(quote ((sequence "TODO(t)" "MIGRATE(m)" "|" "DONE(d)")
		(sequence "WAITING(w@/!)" "HOLD(h@/!)" "|" "CANCELLED(c@/!)" "PHONE" "MEETING"))))
  (setq org-todo-keyword-faces
	(quote (("TODO" :foreground "red" :weight bold)
		("NEXT" :foreground "blue" :weight bold)
		("DONE" :foreground "forest green" :weight bold)
		("WAITING" :foreground "orange" :weight bold)
		("HOLD" :foreground "magenta" :weight bold)
		("CANCELLED" :foreground "forest green" :weight bold)
		("MEETING" :foreground "forest cyan" :weight bold)
		("PHONE" :foreground "blue" :weight bold)))))

;;; Bullets for org-mode
(use-package org-bullets
  :commands org-bullets-mode
  :hook (org-mode . org-bullets-mode))

;;; Org-mode Setup
(setq org-agenda-files (list
			"~/Documents/life.org"))

;;; Pomodoro technique tracking for org-mode
(use-package org-pomodoro)

;;; Journal
(use-package org-journal
  :ensure)

;;; Presentation
(use-package epresent
  :ensure t)

;;; Markdown preview
(use-package flymd
  :ensure)

;;; Lilypond
(progn
  (autoload 'lilypond "lilypond")
  (autoload 'lilypond-mode "lilypond-mode")
  (setq auto-mode-alist
	(cons '("\\.ly$" . LilyPond-mode) auto-mode-alist))
  (add-hook 'LilyPond-mode-hook (lambda () (turn-on-font-lock))))

;;; Flycheck lilypond
(use-package flycheck-lilypond
  :ensure
  :after flycheck)

;;; IRC
(use-package erc
  :ensure)

;;; Telegram client
(use-package telega
  :config (telega-mode-line-mode 1))

;;; convert org to html in gnus
(use-package org-mime
  :ensure)

;;; Dialog program for entering password
(use-package pinentry
  :config
  (setq epa-pinentry-mode 'loopback)
  (pinentry-start))

(use-package so-long
  :config (global-so-long-mode 1))

;;; Disable emacs gui
(menu-bar-mode -1)
(scroll-bar-mode -1)
(tool-bar-mode -1)
(tooltip-mode -1)

(setq-default confirm-nonexistent-file-or-buffer t)

;;; Short messages
(defalias 'yes-or-no-p 'y-or-n-p)

(setq
 save-place-forget-unreadable-files t
 save-place-limit 200)

(save-place-mode 1)

(blink-cursor-mode 1)

(use-package exec-path-from-shell
  :config
  (when (memq window-system '(mac ns x))
    (exec-path-from-shell-initialize)
    (exec-path-from-shell-copy-env "PATH")))

(setq create-lockfiles nil
 make-backup-files nil        ; disable backup files
 auto-save-list-file-name nil ; disable .saves files
 auto-save-default nil        ; disable auto saving)

(column-number-mode)

(use-package which-key
  :config
  (setq which-key-show-early-on-C-h t)
  (setq which-key-side-window-location 'bottom)
  (setq which-key-idle-delay 0.5)
  (setq which-key-popup-type 'side-window)
  (global-set-key (kbd "C-h C-k") 'which-key-show-major-mode)
  (setq which-key-sort-order 'which-key-prefix-then-key-order)
  (which-key-mode))

;;  (use-package guix-autoloads)

  (use-package edit-indirect)
  (use-package build-farm)
  (use-package dash)
  (use-package bui)

;;; Manage docker in emacs
(use-package docker
  :ensure-system-package docker
  :bind ("C-c d" . docker))
