emacs/.emacs-config.org
*** EMMS
#+BEGIN_SRC emacs-lisp
  (use-package emms
    :config
   (emms-all)
   (emms-default-players)
   (setq emms-source-file-default-directory (expand-file-name "~/Music"))
   (setq emms-player-list '(emms-player-mpg321 emms-player-ogg123
			 emms-player-mplayer)))
#+END_SRC
** Баг-трекеры
*** Debbugs
#+BEGIN_SRC emacs-lisp
;;; Bug-Tracker DebBugs
(use-package debbugs)
#+END_SRC
** Демонстрация нажатий и команд
#+BEGIN_SRC emacs-lisp
(use-package keycast
  :ensure)
#+END_SRC
** HTTP сервер
#+BEGIN_SRC emacs-lisp
;;; HTTP server
(use-package simple-httpd)
#+END_SRC

** REST клиент
#+BEGIN_SRC emacs-lisp
;;; Rest client
(use-package restclient)
#+END_SRC
** PDF
#+BEGIN_SRC emacs-lisp
  ;;; PDF Tools
  (use-package pdf-tools
    :if window-system
    :config
    (pdf-loader-install))
#+END_SRC
** Показать пробелы
#+BEGIN_SRC emacs-lisp
   (use-package whitespace
    :config (global-set-key (kbd "C-c w") 'whitespace-mode))
#+END_SRC
** Управление финансами
#+BEGIN_SRC emacs-lisp
;;; Accounting
(use-package ledger-mode)
#+END_SRC
** Скрытие минорных модов
#+BEGIN_SRC emacs-lisp
;;; hide some minor modes
(use-package diminish)
#+END_SRC
** Автосохранение в /tmp
#+BEGIN_SRC emacs-lisp
(setq backup-directory-alist
      `((".*" . ,temporary-file-directory)))
(setq auto-save-file-name-transforms
      `((".*" ,temporary-file-directory t)))
#+END_SRC
** Увеличение/уменьшение шрифта
#+BEGIN_SRC emacs-lisp
(defun zoom-in ()
  (interactive)
  (let ((x (+ (face-attribute 'default :height)
	      10)))
    (set-face-attribute 'default nil :height x)))

(defun zoom-out ()
  (interactive)
  (let ((x (- (face-attribute 'default :height)
	      10)))
    (set-face-attribute 'default nil :height x)))

(define-key global-map (kbd "C-1") 'zoom-in)
(define-key global-map (kbd "C-0") 'zoom-out)
#+END_SRC
** Отключить бипы
#+BEGIN_SRC emacs-lisp
(setq visible-bell t)
#+END_SRC
