emacs/.emacs-config.el

(use-package emms
  :config
 (emms-all)
 (emms-default-players)
 (setq emms-source-file-default-directory (expand-file-name "~/Music"))
 (setq emms-player-list '(emms-player-mpg321 emms-player-ogg123
		       emms-player-mplayer)))

;;; Bug-Tracker DebBugs
(use-package debbugs)

(use-package keycast
  :ensure)

;;; HTTP server
(use-package simple-httpd)

;;; Rest client
(use-package restclient)

;;; PDF Tools
(use-package pdf-tools
  :if window-system
  :config (pdf-tools-install))

(use-package whitespace
 :config (global-set-key (kbd "C-c w") 'whitespace-mode))

;;; Accounting
(use-package ledger-mode)

;;; hide some minor modes
(use-package diminish)
